In [1]:
# Concatenation -> pasting the two DataFrames together

In [2]:
import numpy as np
import pandas as pd

In [3]:
data_one={'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}

In [4]:
one=pd.DataFrame(data_one)

In [5]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [30]:
two=pd.DataFrame({'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [31]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [32]:
pd.concat([one,two],axis=0,ignore_index=False)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [33]:
#  assume both tables are of same features,so join them
two.columns

Index(['C', 'D'], dtype='object')

In [35]:
two.columns=one.columns

In [36]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [38]:
mydf=pd.concat([one,two],axis=0)

In [39]:
mydf.index=range(len(mydf))

In [40]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

## merge

In [47]:
registrations=pd.DataFrame({'reg_id':[1,2,3,4],'name':['Gautam','Pankaj','Nikhil','Jatin']})

In [48]:
logins=pd.DataFrame({'login_id':[1,2,3,4],'name':['Aditya','Gautam','Vishal','Nikhil']})

In [49]:
# inner merge/join
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  login_id
0       1  Gautam         2
1       3  Nikhil         4

In [50]:
# left merge
pd.merge(left=registrations,right=logins,how='left',on='name')

   reg_id    name  login_id
0       1  Gautam       2.0
1       2  Pankaj       NaN
2       3  Nikhil       4.0
3       4   Jatin       NaN

In [52]:
#  right merge
pd.merge(left=registrations,right=logins,how='right')

   reg_id    name  login_id
0     NaN  Aditya         1
1     1.0  Gautam         2
2     NaN  Vishal         3
3     3.0  Nikhil         4

In [53]:
# outer merge
pd.merge(left=registrations,right=logins,how='outer',on='name')

   reg_id    name  login_id
0     1.0  Gautam       2.0
1     2.0  Pankaj       NaN
2     3.0  Nikhil       4.0
3     4.0   Jatin       NaN
4     NaN  Aditya       1.0
5     NaN  Vishal       3.0

## merging based on index